Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f18154.h
// Register: CPCON
#define CPCON CPCON
extern volatile unsigned char           CPCON               __at(0x20D);
#ifndef _LIB_BUILD
asm("CPCON equ 020Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CPRDY                  :1;
        unsigned CPT                    :1;
        unsigned CPREQ                  :1;
        unsigned                        :2;
        unsigned CPOS                   :1;
        unsigned CPON                   :2;
    };
} CPCONbits_t;
extern volatile CPCONbits_t CPCONbits __at(0x20D);
// bitfield macros
#define _CPCON_CPRDY_POSN                                   0x0
#define _CPCON_CPRDY_POSITION                               0x0
#define _CPCON_CPRDY_SIZE                                   0x1
#define _CPCON_CPRDY_LENGTH                                 0x1
#define _CPCON_CPRDY_MASK                                   0x1
#define _CPCON_CPT_POSN                                     0x1
#define _CPCON_CPT_POSITION                                 0x1
#define _CPCON_CPT_SIZE                                     0x1
#define _CPCON_CPT_LENGTH                                   0x1
#define _CPCON_CPT_MASK                                     0x2
#define _CPCON_CPREQ_POSN                                   0x2
#define _CPCON_CPREQ_POSITION                               0x2
#define _CPCON_CPREQ_SIZE                                   0x1
#define _CPCON_CPREQ_LENGTH                                 0x1
#define _CPCON_CPREQ_MASK                                   0x4
#define _CPCON_CPOS_POSN                                    0x5
#define _CPCON_CPOS_POSITION                                0x5
#define _CPCON_CPOS_SIZE                                    0x1
#define _CPCON_CPOS_LENGTH                                  0x1
#define _CPCON_CPOS_MASK                                    0x20
#define _CPCON_CPON_POSN                                    0x6
#define _CPCON_CPON_POSITION                                0x6
#define _CPCON_CPON_SIZE                                    0x2
#define _CPCON_CPON_LENGTH                                  0x2
#define _CPCON_CPON_MASK                                    0xC0

// Register: ZCDCON
#define ZCDCON ZCDCON
extern volatile unsigned char           ZCDCON              __at(0x21F);
#ifndef _LIB_BUILD
asm("ZCDCON equ 021Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned                        :2;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned SEN                    :1;
    };
    struct {
        unsigned ZCDINTN                :1;
        unsigned ZCDINTP                :1;
        unsigned                        :2;
        unsigned ZCDPOL                 :1;
        unsigned ZCDOUT                 :1;
        unsigned                        :1;
        unsigned ZCDSEN                 :1;
    };
} ZCDCONbits_t;
extern volatile ZCDCONbits_t ZCDCONbits __at(0x21F);
// bitfield macros
#define _ZCDCON_INTN_POSN                                   0x0
#define _ZCDCON_INTN_POSITION                               0x0
#define _ZCDCON_INTN_SIZE                                   0x1
#define _ZCDCON_INTN_LENGTH                                 0x1
#define _ZCDCON_INTN_MASK                                   0x1
#define _ZCDCON_INTP_POSN                                   0x1
#define _ZCDCON_INTP_POSITION                               0x1
#define _ZCDCON_INTP_SIZE                                   0x1
#define _ZCDCON_INTP_LENGTH                                 0x1
#define _ZCDCON_INTP_MASK                                   0x2
#define _ZCDCON_POL_POSN                                    0x4
#define _ZCDCON_POL_POSITION                                0x4
#define _ZCDCON_POL_SIZE                                    0x1
#define _ZCDCON_POL_LENGTH                                  0x1
#define _ZCDCON_POL_MASK                                    0x10
#define _ZCDCON_OUT_POSN                                    0x5
#define _ZCDCON_OUT_POSITION                                0x5
#define _ZCDCON_OUT_SIZE                                    0x1
#define _ZCDCON_OUT_LENGTH                                  0x1
#define _ZCDCON_OUT_MASK                                    0x20
#define _ZCDCON_SEN_POSN                                    0x7
#define _ZCDCON_SEN_POSITION                                0x7
#define _ZCDCON_SEN_SIZE                                    0x1
#define _ZCDCON_SEN_LENGTH                                  0x1
#define _ZCDCON_SEN_MASK                                    0x80
#define _ZCDCON_ZCDINTN_POSN                                0x0
#define _ZCDCON_ZCDINTN_POSITION                            0x0
#define _ZCDCON_ZCDINTN_SIZE                                0x1
#define _ZCDCON_ZCDINTN_LENGTH                              0x1
#define _ZCDCON_ZCDINTN_MASK                                0x1
#define _ZCDCON_ZCDINTP_POSN                                0x1
#define _ZCDCON_ZCDINTP_POSITION                            0x1
#define _ZCDCON_ZCDINTP_SIZE                                0x1
#define _ZCDCON_ZCDINTP_LENGTH                              0x1
#define _ZCDCON_ZCDINTP_MASK                                0x2
#define _ZCDCON_ZCDPOL_POSN                                 0x4
#define _ZCDCON_ZCDPOL_POSITION                             0x4
#define _ZCDCON_ZCDPOL_SIZE                                 0x1
#define _ZCDCON_ZCDPOL_LENGTH                               0x1
#define _ZCDCON_ZCDPOL_MASK                                 0x10
#define _ZCDCON_ZCDOUT_POSN                                 0x5
#define _ZCDCON_ZCDOUT_POSITION                             0x5
#define _ZCDCON_ZCDOUT_SIZE                                 0x1
#define _ZCDCON_ZCDOUT_LENGTH                               0x1
#define _ZCDCON_ZCDOUT_MASK                                 0x20
#define _ZCDCON_ZCDSEN_POSN                                 0x7
#define _ZCDCON_ZCDSEN_POSITION                             0x7
#define _ZCDCON_ZCDSEN_SIZE                                 0x1
#define _ZCDCON_ZCDSEN_LENGTH                               0x1
#define _ZCDCON_ZCDSEN_MASK                                 0x80

