Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f18154.h
// Register: PWM2S1P2
#define PWM2S1P2 PWM2S1P2
extern volatile unsigned short          PWM2S1P2            __at(0x519);
#ifndef _LIB_BUILD
asm("PWM2S1P2 equ 0519h");
#endif

// Register: PWM2S1P2L
#define PWM2S1P2L PWM2S1P2L
extern volatile unsigned char           PWM2S1P2L           __at(0x519);
#ifndef _LIB_BUILD
asm("PWM2S1P2L equ 0519h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2L                    :8;
    };
    struct {
        unsigned S1P2L                  :8;
    };
} PWM2S1P2Lbits_t;
extern volatile PWM2S1P2Lbits_t PWM2S1P2Lbits __at(0x519);
// bitfield macros
#define _PWM2S1P2L_P2L_POSN                                 0x0
#define _PWM2S1P2L_P2L_POSITION                             0x0
#define _PWM2S1P2L_P2L_SIZE                                 0x8
#define _PWM2S1P2L_P2L_LENGTH                               0x8
#define _PWM2S1P2L_P2L_MASK                                 0xFF
#define _PWM2S1P2L_S1P2L_POSN                               0x0
#define _PWM2S1P2L_S1P2L_POSITION                           0x0
#define _PWM2S1P2L_S1P2L_SIZE                               0x8
#define _PWM2S1P2L_S1P2L_LENGTH                             0x8
#define _PWM2S1P2L_S1P2L_MASK                               0xFF

// Register: PWM2S1P2H
#define PWM2S1P2H PWM2S1P2H
extern volatile unsigned char           PWM2S1P2H           __at(0x51A);
#ifndef _LIB_BUILD
asm("PWM2S1P2H equ 051Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2H                    :8;
    };
    struct {
        unsigned S1P2H                  :8;
    };
} PWM2S1P2Hbits_t;
extern volatile PWM2S1P2Hbits_t PWM2S1P2Hbits __at(0x51A);
// bitfield macros
#define _PWM2S1P2H_P2H_POSN                                 0x0
#define _PWM2S1P2H_P2H_POSITION                             0x0
#define _PWM2S1P2H_P2H_SIZE                                 0x8
#define _PWM2S1P2H_P2H_LENGTH                               0x8
#define _PWM2S1P2H_P2H_MASK                                 0xFF
#define _PWM2S1P2H_S1P2H_POSN                               0x0
#define _PWM2S1P2H_S1P2H_POSITION                           0x0
#define _PWM2S1P2H_S1P2H_SIZE                               0x8
#define _PWM2S1P2H_S1P2H_LENGTH                             0x8
#define _PWM2S1P2H_S1P2H_MASK                               0xFF

// Register: NCO1ACC
#define NCO1ACC NCO1ACC
#ifndef __CCI__
extern volatile __uint24                NCO1ACC             __at(0x58C);
#endif
#ifndef _LIB_BUILD
asm("NCO1ACC equ 058Ch");
#endif

// Register: NCO1ACCL
#define NCO1ACCL NCO1ACCL
extern volatile unsigned char           NCO1ACCL            __at(0x58C);
#ifndef _LIB_BUILD
asm("NCO1ACCL equ 058Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACC                    :8;
    };
    struct {
        unsigned NCO1ACC0               :1;
        unsigned NCO1ACC1               :1;
        unsigned NCO1ACC2               :1;
        unsigned NCO1ACC3               :1;
        unsigned NCO1ACC4               :1;
        unsigned NCO1ACC5               :1;
        unsigned NCO1ACC6               :1;
        unsigned NCO1ACC7               :1;
    };
    struct {
        unsigned ACC0                   :1;
        unsigned ACC1                   :1;
        unsigned ACC2                   :1;
        unsigned ACC3                   :1;
        unsigned ACC4                   :1;
        unsigned ACC5                   :1;
        unsigned ACC6                   :1;
        unsigned ACC7                   :1;
    };
    struct {
        unsigned NCO1ACC                :8;
    };
} NCO1ACCLbits_t;
extern volatile NCO1ACCLbits_t NCO1ACCLbits __at(0x58C);
// bitfield macros
#define _NCO1ACCL_ACC_POSN                                  0x0
#define _NCO1ACCL_ACC_POSITION                              0x0
#define _NCO1ACCL_ACC_SIZE                                  0x8
#define _NCO1ACCL_ACC_LENGTH                                0x8
#define _NCO1ACCL_ACC_MASK                                  0xFF
#define _NCO1ACCL_NCO1ACC0_POSN                             0x0
#define _NCO1ACCL_NCO1ACC0_POSITION                         0x0
#define _NCO1ACCL_NCO1ACC0_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC0_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC0_MASK                             0x1
#define _NCO1ACCL_NCO1ACC1_POSN                             0x1
#define _NCO1ACCL_NCO1ACC1_POSITION                         0x1
#define _NCO1ACCL_NCO1ACC1_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC1_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC1_MASK                             0x2
#define _NCO1ACCL_NCO1ACC2_POSN                             0x2
#define _NCO1ACCL_NCO1ACC2_POSITION                         0x2
#define _NCO1ACCL_NCO1ACC2_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC2_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC2_MASK                             0x4
#define _NCO1ACCL_NCO1ACC3_POSN                             0x3
#define _NCO1ACCL_NCO1ACC3_POSITION                         0x3
#define _NCO1ACCL_NCO1ACC3_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC3_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC3_MASK                             0x8
#define _NCO1ACCL_NCO1ACC4_POSN                             0x4
#define _NCO1ACCL_NCO1ACC4_POSITION                         0x4
#define _NCO1ACCL_NCO1ACC4_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC4_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC4_MASK                             0x10
#define _NCO1ACCL_NCO1ACC5_POSN                             0x5
#define _NCO1ACCL_NCO1ACC5_POSITION                         0x5
#define _NCO1ACCL_NCO1ACC5_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC5_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC5_MASK                             0x20
#define _NCO1ACCL_NCO1ACC6_POSN                             0x6
#define _NCO1ACCL_NCO1ACC6_POSITION                         0x6
#define _NCO1ACCL_NCO1ACC6_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC6_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC6_MASK                             0x40
#define _NCO1ACCL_NCO1ACC7_POSN                             0x7
#define _NCO1ACCL_NCO1ACC7_POSITION                         0x7
#define _NCO1ACCL_NCO1ACC7_SIZE                             0x1
#define _NCO1ACCL_NCO1ACC7_LENGTH                           0x1
#define _NCO1ACCL_NCO1ACC7_MASK                             0x80
#define _NCO1ACCL_ACC0_POSN                                 0x0
#define _NCO1ACCL_ACC0_POSITION                             0x0
#define _NCO1ACCL_ACC0_SIZE                                 0x1
#define _NCO1ACCL_ACC0_LENGTH                               0x1
#define _NCO1ACCL_ACC0_MASK                                 0x1
#define _NCO1ACCL_ACC1_POSN                                 0x1
#define _NCO1ACCL_ACC1_POSITION                             0x1
#define _NCO1ACCL_ACC1_SIZE                                 0x1
#define _NCO1ACCL_ACC1_LENGTH                               0x1
#define _NCO1ACCL_ACC1_MASK                                 0x2
#define _NCO1ACCL_ACC2_POSN                                 0x2
#define _NCO1ACCL_ACC2_POSITION                             0x2
#define _NCO1ACCL_ACC2_SIZE                                 0x1
#define _NCO1ACCL_ACC2_LENGTH                               0x1
#define _NCO1ACCL_ACC2_MASK                                 0x4
#define _NCO1ACCL_ACC3_POSN                                 0x3
#define _NCO1ACCL_ACC3_POSITION                             0x3
#define _NCO1ACCL_ACC3_SIZE                                 0x1
#define _NCO1ACCL_ACC3_LENGTH                               0x1
#define _NCO1ACCL_ACC3_MASK                                 0x8
#define _NCO1ACCL_ACC4_POSN                                 0x4
#define _NCO1ACCL_ACC4_POSITION                             0x4
#define _NCO1ACCL_ACC4_SIZE                                 0x1
#define _NCO1ACCL_ACC4_LENGTH                               0x1
#define _NCO1ACCL_ACC4_MASK                                 0x10
#define _NCO1ACCL_ACC5_POSN                                 0x5
#define _NCO1ACCL_ACC5_POSITION                             0x5
#define _NCO1ACCL_ACC5_SIZE                                 0x1
#define _NCO1ACCL_ACC5_LENGTH                               0x1
#define _NCO1ACCL_ACC5_MASK                                 0x20
#define _NCO1ACCL_ACC6_POSN                                 0x6
#define _NCO1ACCL_ACC6_POSITION                             0x6
#define _NCO1ACCL_ACC6_SIZE                                 0x1
#define _NCO1ACCL_ACC6_LENGTH                               0x1
#define _NCO1ACCL_ACC6_MASK                                 0x40
#define _NCO1ACCL_ACC7_POSN                                 0x7
#define _NCO1ACCL_ACC7_POSITION                             0x7
#define _NCO1ACCL_ACC7_SIZE                                 0x1
#define _NCO1ACCL_ACC7_LENGTH                               0x1
#define _NCO1ACCL_ACC7_MASK                                 0x80
#define _NCO1ACCL_NCO1ACC_POSN                              0x0
#define _NCO1ACCL_NCO1ACC_POSITION                          0x0
#define _NCO1ACCL_NCO1ACC_SIZE                              0x8
#define _NCO1ACCL_NCO1ACC_LENGTH                            0x8
#define _NCO1ACCL_NCO1ACC_MASK                              0xFF

// Register: NCO1ACCH
#define NCO1ACCH NCO1ACCH
extern volatile unsigned char           NCO1ACCH            __at(0x58D);
#ifndef _LIB_BUILD
asm("NCO1ACCH equ 058Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned ACC                    :8;
    };
    struct {
        unsigned NCO1ACC8               :1;
        unsigned NCO1ACC9               :1;
        unsigned NCO1ACC10              :1;
        unsigned NCO1ACC11              :1;
        unsigned NCO1ACC12              :1;
        unsigned NCO1ACC13              :1;
        unsigned NCO1ACC14              :1;
        unsigned NCO1ACC15              :1;
    };
    struct {
        unsigned ACC8                   :1;
        unsigned ACC9                   :1;
        unsigned ACC10                  :1;
        unsigned ACC11                  :1;
        unsigned ACC12                  :1;
        unsigned ACC13                  :1;
        unsigned ACC14                  :1;
        unsigned ACC15                  :1;
    };
    struct {
        unsigned NCO1ACC                :8;
    };
} NCO1ACCHbits_t;
extern volatile NCO1ACCHbits_t NCO1ACCHbits __at(0x58D);
// bitfield macros
#define _NCO1ACCH_ACC_POSN                                  0x0
#define _NCO1ACCH_ACC_POSITION                              0x0
#define _NCO1ACCH_ACC_SIZE                                  0x8
#define _NCO1ACCH_ACC_LENGTH                                0x8
#define _NCO1ACCH_ACC_MASK                                  0xFF
#define _NCO1ACCH_NCO1ACC8_POSN                             0x0
#define _NCO1ACCH_NCO1ACC8_POSITION                         0x0
#define _NCO1ACCH_NCO1ACC8_SIZE                             0x1
#define _NCO1ACCH_NCO1ACC8_LENGTH                           0x1
#define _NCO1ACCH_NCO1ACC8_MASK                             0x1
#define _NCO1ACCH_NCO1ACC9_POSN                             0x1
#define _NCO1ACCH_NCO1ACC9_POSITION                         0x1
#define _NCO1ACCH_NCO1ACC9_SIZE                             0x1
#define _NCO1ACCH_NCO1ACC9_LENGTH                           0x1
#define _NCO1ACCH_NCO1ACC9_MASK                             0x2
#define _NCO1ACCH_NCO1ACC10_POSN                            0x2
#define _NCO1ACCH_NCO1ACC10_POSITION                        0x2
#define _NCO1ACCH_NCO1ACC10_SIZE                            0x1
#define _NCO1ACCH_NCO1ACC10_LENGTH                          0x1
#define _NCO1ACCH_NCO1ACC10_MASK                            0x4
#define _NCO1ACCH_NCO1ACC11_POSN                            0x3
#define _NCO1ACCH_NCO1ACC11_POSITION                        0x3
#define _NCO1ACCH_NCO1ACC11_SIZE                            0x1
#define _NCO1ACCH_NCO1ACC11_LENGTH                          0x1
#define _NCO1ACCH_NCO1ACC11_MASK                            0x8
#define _NCO1ACCH_NCO1ACC12_POSN                            0x4
#define _NCO1ACCH_NCO1ACC12_POSITION                        0x4
#define _NCO1ACCH_NCO1ACC12_SIZE                            0x1
#define _NCO1ACCH_NCO1ACC12_LENGTH                          0x1
#define _NCO1ACCH_NCO1ACC12_MASK                            0x10
#define _NCO1ACCH_NCO1ACC13_POSN                            0x5
#define _NCO1ACCH_NCO1ACC13_POSITION                        0x5
#define _NCO1ACCH_NCO1ACC13_SIZE                            0x1
#define _NCO1ACCH_NCO1ACC13_LENGTH                          0x1
#define _NCO1ACCH_NCO1ACC13_MASK                            0x20
#define _NCO1ACCH_NCO1ACC14_POSN                            0x6
#define _NCO1ACCH_NCO1ACC14_POSITION                        0x6
#define _NCO1ACCH_NCO1ACC14_SIZE                            0x1
#define _NCO1ACCH_NCO1ACC14_LENGTH                          0x1
#define _NCO1ACCH_NCO1ACC14_MASK                            0x40
#define _NCO1ACCH_NCO1ACC15_POSN                            0x7
#define _NCO1ACCH_NCO1ACC15_POSITION                        0x7
#define _NCO1ACCH_NCO1ACC15_SIZE                            0x1
#define _NCO1ACCH_NCO1ACC15_LENGTH                          0x1
#define _NCO1ACCH_NCO1ACC15_MASK                            0x80
#define _NCO1ACCH_ACC8_POSN                                 0x0
#define _NCO1ACCH_ACC8_POSITION                             0x0
#define _NCO1ACCH_ACC8_SIZE                                 0x1
#define _NCO1ACCH_ACC8_LENGTH                               0x1
#define _NCO1ACCH_ACC8_MASK                                 0x1
#define _NCO1ACCH_ACC9_POSN                                 0x1
#define _NCO1ACCH_ACC9_POSITION                             0x1
#define _NCO1ACCH_ACC9_SIZE                                 0x1
#define _NCO1ACCH_ACC9_LENGTH                               0x1
#define _NCO1ACCH_ACC9_MASK                                 0x2
#define _NCO1ACCH_ACC10_POSN                                0x2
#define _NCO1ACCH_ACC10_POSITION                            0x2
#define _NCO1ACCH_ACC10_SIZE                                0x1
#define _NCO1ACCH_ACC10_LENGTH                              0x1
#define _NCO1ACCH_ACC10_MASK                                0x4
#define _NCO1ACCH_ACC11_POSN                                0x3
#define _NCO1ACCH_ACC11_POSITION                            0x3
#define _NCO1ACCH_ACC11_SIZE                                0x1
#define _NCO1ACCH_ACC11_LENGTH                              0x1
#define _NCO1ACCH_ACC11_MASK                                0x8
#define _NCO1ACCH_ACC12_POSN                                0x4
#define _NCO1ACCH_ACC12_POSITION                            0x4
#define _NCO1ACCH_ACC12_SIZE                                0x1
#define _NCO1ACCH_ACC12_LENGTH                              0x1
#define _NCO1ACCH_ACC12_MASK                                0x10
#define _NCO1ACCH_ACC13_POSN                                0x5
#define _NCO1ACCH_ACC13_POSITION                            0x5
#define _NCO1ACCH_ACC13_SIZE                                0x1
#define _NCO1ACCH_ACC13_LENGTH                              0x1
#define _NCO1ACCH_ACC13_MASK                                0x20
#define _NCO1ACCH_ACC14_POSN                                0x6
#define _NCO1ACCH_ACC14_POSITION                            0x6
#define _NCO1ACCH_ACC14_SIZE                                0x1
#define _NCO1ACCH_ACC14_LENGTH                              0x1
#define _NCO1ACCH_ACC14_MASK                                0x40
#define _NCO1ACCH_ACC15_POSN                                0x7
#define _NCO1ACCH_ACC15_POSITION                            0x7
#define _NCO1ACCH_ACC15_SIZE                                0x1
#define _NCO1ACCH_ACC15_LENGTH                              0x1
#define _NCO1ACCH_ACC15_MASK                                0x80
#define _NCO1ACCH_NCO1ACC_POSN                              0x0
#define _NCO1ACCH_NCO1ACC_POSITION                          0x0
#define _NCO1ACCH_NCO1ACC_SIZE                              0x8
#define _NCO1ACCH_NCO1ACC_LENGTH                            0x8
#define _NCO1ACCH_NCO1ACC_MASK                              0xFF

