Kakakacarrotcake/bazel_toolchain_atmega/mplab_xc8_compiler/v3.00/pic/include/proc/pic16f18154.h
extern volatile PWM4S1P1Hbits_t PWM4S1P1Hbits __at(0xA18);
// bitfield macros
#define _PWM4S1P1H_P1H_POSN                                 0x0
#define _PWM4S1P1H_P1H_POSITION                             0x0
#define _PWM4S1P1H_P1H_SIZE                                 0x8
#define _PWM4S1P1H_P1H_LENGTH                               0x8
#define _PWM4S1P1H_P1H_MASK                                 0xFF
#define _PWM4S1P1H_S1P1H_POSN                               0x0
#define _PWM4S1P1H_S1P1H_POSITION                           0x0
#define _PWM4S1P1H_S1P1H_SIZE                               0x8
#define _PWM4S1P1H_S1P1H_LENGTH                             0x8
#define _PWM4S1P1H_S1P1H_MASK                               0xFF

// Register: PWM4S1P2
#define PWM4S1P2 PWM4S1P2
extern volatile unsigned short          PWM4S1P2            __at(0xA19);
#ifndef _LIB_BUILD
asm("PWM4S1P2 equ 0A19h");
#endif

// Register: PWM4S1P2L
#define PWM4S1P2L PWM4S1P2L
extern volatile unsigned char           PWM4S1P2L           __at(0xA19);
#ifndef _LIB_BUILD
asm("PWM4S1P2L equ 0A19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2L                    :8;
    };
    struct {
        unsigned S1P2L                  :8;
    };
} PWM4S1P2Lbits_t;
extern volatile PWM4S1P2Lbits_t PWM4S1P2Lbits __at(0xA19);
// bitfield macros
#define _PWM4S1P2L_P2L_POSN                                 0x0
#define _PWM4S1P2L_P2L_POSITION                             0x0
#define _PWM4S1P2L_P2L_SIZE                                 0x8
#define _PWM4S1P2L_P2L_LENGTH                               0x8
#define _PWM4S1P2L_P2L_MASK                                 0xFF
#define _PWM4S1P2L_S1P2L_POSN                               0x0
#define _PWM4S1P2L_S1P2L_POSITION                           0x0
#define _PWM4S1P2L_S1P2L_SIZE                               0x8
#define _PWM4S1P2L_S1P2L_LENGTH                             0x8
#define _PWM4S1P2L_S1P2L_MASK                               0xFF

// Register: PWM4S1P2H
#define PWM4S1P2H PWM4S1P2H
extern volatile unsigned char           PWM4S1P2H           __at(0xA1A);
#ifndef _LIB_BUILD
asm("PWM4S1P2H equ 0A1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned P2H                    :8;
    };
    struct {
        unsigned S1P2H                  :8;
    };
} PWM4S1P2Hbits_t;
extern volatile PWM4S1P2Hbits_t PWM4S1P2Hbits __at(0xA1A);
// bitfield macros
#define _PWM4S1P2H_P2H_POSN                                 0x0
#define _PWM4S1P2H_P2H_POSITION                             0x0
#define _PWM4S1P2H_P2H_SIZE                                 0x8
#define _PWM4S1P2H_P2H_LENGTH                               0x8
#define _PWM4S1P2H_P2H_MASK                                 0xFF
#define _PWM4S1P2H_S1P2H_POSN                               0x0
#define _PWM4S1P2H_S1P2H_POSITION                           0x0
#define _PWM4S1P2H_S1P2H_SIZE                               0x8
#define _PWM4S1P2H_S1P2H_LENGTH                             0x8
#define _PWM4S1P2H_S1P2H_MASK                               0xFF

// Register: NVMADR
#define NVMADR NVMADR
extern volatile unsigned short          NVMADR              __at(0x1C8C);
#ifndef _LIB_BUILD
asm("NVMADR equ 01C8Ch");
#endif

// Register: NVMADRL
#define NVMADRL NVMADRL
extern volatile unsigned char           NVMADRL             __at(0x1C8C);
#ifndef _LIB_BUILD
asm("NVMADRL equ 01C8Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NVMADR                 :8;
    };
    struct {
        unsigned NVMADR0                :1;
        unsigned NVMADR1                :1;
        unsigned NVMADR2                :1;
        unsigned NVMADR3                :1;
        unsigned NVMADR4                :1;
        unsigned NVMADR5                :1;
        unsigned NVMADR6                :1;
        unsigned NVMADR7                :1;
    };
} NVMADRLbits_t;
extern volatile NVMADRLbits_t NVMADRLbits __at(0x1C8C);
// bitfield macros
#define _NVMADRL_NVMADR_POSN                                0x0
#define _NVMADRL_NVMADR_POSITION                            0x0
#define _NVMADRL_NVMADR_SIZE                                0x8
#define _NVMADRL_NVMADR_LENGTH                              0x8
#define _NVMADRL_NVMADR_MASK                                0xFF
#define _NVMADRL_NVMADR0_POSN                               0x0
#define _NVMADRL_NVMADR0_POSITION                           0x0
#define _NVMADRL_NVMADR0_SIZE                               0x1
#define _NVMADRL_NVMADR0_LENGTH                             0x1
#define _NVMADRL_NVMADR0_MASK                               0x1
#define _NVMADRL_NVMADR1_POSN                               0x1
#define _NVMADRL_NVMADR1_POSITION                           0x1
#define _NVMADRL_NVMADR1_SIZE                               0x1
#define _NVMADRL_NVMADR1_LENGTH                             0x1
#define _NVMADRL_NVMADR1_MASK                               0x2
#define _NVMADRL_NVMADR2_POSN                               0x2
#define _NVMADRL_NVMADR2_POSITION                           0x2
#define _NVMADRL_NVMADR2_SIZE                               0x1
#define _NVMADRL_NVMADR2_LENGTH                             0x1
#define _NVMADRL_NVMADR2_MASK                               0x4
#define _NVMADRL_NVMADR3_POSN                               0x3
#define _NVMADRL_NVMADR3_POSITION                           0x3
#define _NVMADRL_NVMADR3_SIZE                               0x1
#define _NVMADRL_NVMADR3_LENGTH                             0x1
#define _NVMADRL_NVMADR3_MASK                               0x8
#define _NVMADRL_NVMADR4_POSN                               0x4
#define _NVMADRL_NVMADR4_POSITION                           0x4
#define _NVMADRL_NVMADR4_SIZE                               0x1
#define _NVMADRL_NVMADR4_LENGTH                             0x1
#define _NVMADRL_NVMADR4_MASK                               0x10
#define _NVMADRL_NVMADR5_POSN                               0x5
#define _NVMADRL_NVMADR5_POSITION                           0x5
#define _NVMADRL_NVMADR5_SIZE                               0x1
#define _NVMADRL_NVMADR5_LENGTH                             0x1
#define _NVMADRL_NVMADR5_MASK                               0x20
#define _NVMADRL_NVMADR6_POSN                               0x6
#define _NVMADRL_NVMADR6_POSITION                           0x6
#define _NVMADRL_NVMADR6_SIZE                               0x1
#define _NVMADRL_NVMADR6_LENGTH                             0x1
#define _NVMADRL_NVMADR6_MASK                               0x40
#define _NVMADRL_NVMADR7_POSN                               0x7
#define _NVMADRL_NVMADR7_POSITION                           0x7
#define _NVMADRL_NVMADR7_SIZE                               0x1
#define _NVMADRL_NVMADR7_LENGTH                             0x1
#define _NVMADRL_NVMADR7_MASK                               0x80

